#!/usr/bin/env python
# -*- encoding: utf-8 -*-
'''
@Filename    :   1.出租系统需求和界面.py
@Time    :   2025/03/02 17:58:27
@Author  :   Baikal
@Motto     :追风赶月莫停留,平芜尽处是春山.
'''
"""
项目的需求说明
1.实现基于文本界面的房屋出租软件
2.能实现都房屋信息的添加,修改和删除,并能够打印房屋信息的明细表
"""
# 项目界面-主菜单
# =============房屋出租系统菜单==================
"""
1.新增房源
2.查找房屋
3.删除房屋信息
4.修改房屋信息
5.房屋列表
6.退出
请输入你的选择(1~6):
"""


# 项目界面-新增房源
# =============添加房屋==================
"""
1.姓名:tom
2.电话:112
3.地址:海淀
4.租金:800
5.状态:未出租
"""
# =============添加房屋成功==================

# 项目界面-查找房屋
# =============添加房屋==================
# =============查找房屋信息==================
"""
请输入要查找的id
编号  房主  电话  地址  月租  状态(未出租/已出租)
 1    tom  112  海淀  800  未出租
"""
# =============查找房屋信息成功==================

# 项目界面-删除房屋信息
# =============查删除房屋信息==================
"""
请输入待删除房屋的编号(-1退出):1
请输入你的选择(Y/N),请确认选择:Y
"""
# =============删除房屋信息成功==================

# =============查删除房屋信息==================
"""
请输入待删除房屋的编号(-1退出):10
请输入你的选择(Y/N),请确认选择:Y
"""
# =============房屋编号不存在,删除房屋信息失败==================


# 项目界面-修改房源
# =============修改房源信息==================
"""
请选择待修改房屋编号(-1表示退出):2
姓名(tom):tim
电话(112):113
地址(朝阳):海淀
租金(900):800
状态:(未出租):已出租
"""
# =============修改房源信息成功==================


# =============房屋列表==================
"""
请输入要查找的id
编号  房主  电话  地址  月租  状态(未出租/已出租)
 1    tom  112  海淀  800  未出租
 2    Baikal  112  海淀  800  未出租
"""
# =============房屋信息显示完毕==================

# ============退出系统==================
# 请输入你的先择(1-6):6
# 请输入你的选择:(Y/N),请确认选择:t
# 选择错误,请重新输入:y
# 你退出了程序,欢迎下次使用
