#!/usr/bin/env python
# -*- encoding: utf-8 -*-
'''
@Filename    :   38.赋值表达式(海象运算符).py
@Time    :   2025/02/04 20:15:15
@Author  :   Baikal
@Motto     :追风赶月莫停留,平芜尽处是春山.
'''
# 赋值运算符(海象运算符)
# ! 语法: <标识符> := <表达式> 计算表达式的值并直接赋值给标识符,
# 赋值表达式将表达式的值赋值给标识符,同时返回表达式的值,而我们普通的赋值语句只进行赋值操作,并不会返回表达式的值.
# 赋值表达式一般用在流程控制语句,设计的初衷为了减少多余的赋值操作.
a = (b := 7) * 33
print(a, b)

a = 11
if a > 10:
    print(a)


# 使用赋值表达式
if (b := 11) > 10:
    print(b)
# 如果a的长度大于2,则输出a的长度
a = range(3)
if (n := len(a)) > 2:
    print(n)

# 如果range(100)的和大于1000,则输入这个和
if (x := sum(range(100))) > 1000:
    print(x)

# 循环累加x,输出累加过程的值
x = 0
while (x := x + 1) < 5:
    print(x)
# 输入密码,如果不正确则提示这个密码布正确
while (psw := input("请输入密码")) != "123":
    print("密码", psw, "不正确")
    continue
print("登录成功")
